final Map<String, Map<int, String>> pageTexts = {
  'uk': {
    1: '''
У густому-прегустому лісі, де гілки схожі на дикі пазурі та навіть вітри ходили навшпиньки, жила Баба Яга. Її хата на курячих ніжках стояла на галявині. Скрипуча, перекошена, з вікнами, що примружуються, мов хитрі очі, і дахом, який постійно здригається, наче чхає від старого пороху.
Казали, що бабині котли ніколи не холонуть, мітла вночі літає сама, а погляд може змусити навіть альфа-вовка хвоста підібгати.
''',

    3: '''
Але мало хто знав, що в дитинстві ця грізна чаклунка була звичайною дівчинкою — Ягусею.
У школі життя Ягусі було суцільним випробуванням. Її коса стирчала в різні боки, ніби щоранку вона боролася з драконом (і, здається, програвала).
А хлопці дражнили її за худенькі ніжки:
— Гей, Куряча ніжко, не заплутайся в траві!
''',

    5: '''
Ще й легенди розповідали, що її бабуся чаклує і варить зілля з жаб’ячих лапок.
— Ягуся, що там на вечерю?! Жаб'ячий суп? — насміхалися однокласники.
Ягуся мовчки збирала образи та сльози у маленькі баночки, підписувала й ховала їх під ліжком.
Вона уявляла, як одного дня відкриє їх — і всі кривдники враз почнуть розмовляти навпаки, забуватимуть власні імена чи загублять зарядку від телефону!
''',

    7: '''
Спочатку дівчинка просто ображалася, але потім зрозуміла: краще бути злою та всіх лякати.
Вона навчилася так стискати кулачки, що навіть старшокласники поступалися їй дорогою.
Найбільше Ягусю розумів Кіт. Він з’являвся несподівано, ніби матеріалізувався з тіні, й дивився так, ніби знав усі секрети цього світу.
Одне його око було блакитним, як небо, інше — жовте, як пшеничне поле.
Кіт завжди слідкував за Ягою та до будь-якої ситуації мав коментарі, від яких було трохи смішно, але й задуматися хотілося.
Тож, одного дня Баба Яга прокинулася і зрозуміла: щось не так…
Її день зазвичай починався з бурчання: то казан підгорить, то мітла впаде на голову.
А сьогодні — нічого! Казан спокійно кипів, мітла слухняно стояла в кутку…А Бабі… захотілося навести лад у хаті! І це було дууууже дивно…
''',

    8: '''
Вона театрально закинула руку на чоло, ніби героїня серіалу. Кіт, що якраз розтягся, щоб наточити кігті, примружив очі.
— Драма на рівному місці, — позіхнув він. — Може, ти просто виспалася?— Ні, щось не так, Коте, мені захотілося повісити на вікна вишиті фіранки!
— ВИ-ШИ-ТІ, уявляєш?! — вигукнула Яга, схопившись за голову.
— Це не я! Може, я захворіла?! Хоча… зараза до зарази не клеїться. Точно! Мою злість викрали! ПОГРАБУВАЛИ! Швидко накинувши плащ із павутиння, вона схопила мітлу (яка бурчала, але либоко в душі її любила) і вирушила на пошуки злодія.
''',

    10: '''
Першим підозрюваним був Лісовик. На сонячній галявині він сидів на пеньку, жував корінець і весело мугикав:
— Ой, на болоті я сиджу, грибочки їм, у вус свищу…
— Це ти, волохатий, мою злість взяв без дозволу?! — насупилася Яга і ткнула в нього своїм кривим пальцем.
— Я?! — Лісовик ледь не подавився корінцем. — Ти ж учора так верещала на мене, що в мене аж гриби в горлі застрягли – досі не можу викашляти, а борода почала лисіти, бачиш?! Якби брав твою злість, негайно б віддав! Та камінця мені в чобіт під босу п’ятку, не брав, Яго!
''',

    12: '''
Кіт сидів на дереві, звісившись головою вниз, його блакитне око дивилося на Ягу, а жовте — на Лісовика.
— Ну, і як ти думаєш, Яго? Ти впевнена, що злість украли, може, ти сама її загубила?
Яга відмахнулася, але слова кота застрягли в голові…
Яга вирушила до болота, де Кикимора в’язала светрика равлику і слухала щось схоже на звуки водоспаду.
— А, болотна, це ти вкрала мою злість? — запитала Яга, прискіпливо дивлячись на спиці.
— Навіщо мені твоя злість? — Кикимора навіть не глянула в її бік.
— Я тепер на йогу з жабами ходжу. Ось, петлі рахую - гармонізую чакри!
Яга ледь не впала:
— Кикимора і гармонія?! Оце вже кінець світу…
''',

    14: '''
Кіт вийшов нізвідки і штовхнув лапою клубочок Кикимори:
— Ти досі шукаєш, Яго? — запитав він своїм звичним, злегка провокаційним тоном. — Чи справді ти шукаєш свою злість?
Яга просто відмахнулась:
— Ти тільки не заважай, Коте! Я в пошуках сили!
Кіт просто посміхнувся й зник у невідомому напрямку, залишивши лише відлуння своїх слів:
— Сила — це не те, що ти шукаєш, Яго. Сила — це те, чим ти вже є...
''',

    15: '''
Останньою в списку була Злюка-Гадюка. Вона завжди заздрила Язі та її злій силі, тому Яга була майже впевнена, що саме Гадюка причетна до зникнення злості.
— Ти що це робиш?! — вигукнула Яга, коли побачила Гадюку біля печі.
— Пиріжки печу, — спокійно відповіла та. — Для місцевих їжачків, вони допомагають мені складати дрова.
— Ти ж… ти ж Злюка! — Яга аж затупала ногою.
— А ти ніколи не думала, що бути злою втомлює? — відповіла Гадюка, дістаючи рум'яні пиріжки, хочеш? – запропонувала Гадюка свіженького пиріжка Язі…
''',

    17: '''
Розчарована Яга пішла до озера, сіла на великий камінь і помітила своє відображення у воді.
Вода в озері почала вирувати, і над нею почав наростати туман, що раптом набрав форму Бабиного обличчя.
— Це озеро показує справжню сутність. Ким ти хочеш бути? — із туману, як грім, прозвучав грізний голос Прадавнього Лісового Духа (чий голос чомусь дуже нагадував голос різноокого кота)... і раптом серед туману, як у дзеркалі, Яга побачила себе різною — злою, самотньою, а ще і тією, якою могла б стати, якби дозволила собі доброту.
Яга розплакалася, її сльози крапали в озеро. Туман почав танути і в його глибині ледь-ледь замерехтіло якесь дивне світло.
''',

    18: '''
Туман все танув, і стало видно, що серед озера у воді борсається маленька сяюча істота — Сонячний зайчик. Він бився об воду зовсім безсилий і вже майже згас. Зайчик заплутався у довгих водоростях, які привалив великий камінь на дні.
Яга побачила Сонячного зайчика і хотіла відвернутися, але чомусь відчула, що він їй дуже знайомий.
— Ти… ти ж… — Яга не могла повірити своїм очам.
— Це частина твоєї душі, Яго, — грізно прозвучав голос Прадавнього Лісового Духа. — Частина, яку ти забула. Це те, що ти втратила, намагаючись завжди бути злою.
''',

    20: '''
Сонячний зайчик — це твоє забуте добро. Допоможи йому, і ти знову знайдеш свою силу!
Вона присіла біля озера і подивилася на камінь, який лежав у воді. Він був важкий і великий. Баба знала, що їй доведеться залізти у воду, щоб зрушити його.
Яга не любила торкатися води. У дитинстві її важко було змусити вмиватися. Перед школою вона просто намочувала пальці і протирала ними очі…
''',

    21: '''
Різноокий Кіт сидів на найближчому камені і вмивався, між тим його обидва ока слідкували за Ягою:
— О, який цікавий момент, Яго. Ти, як і я, не дуже любиш мокнути, правда ж! Я б не стрибав у ту воду, - сказав він задумливо і почав вилизувати лапу, яка трохи намокла у воді. — Хіба, якби моя котяча сила та харизма були під загрозою…
Яга затримала подих. Відчуття, що вона може втратити свою силу, холодком пройшлося її спиною. Вона уявила себе без своєї могутності – слабкою, беззахисною, такою, що ні дерева, ні звірі більше не сприйматимуть її господинею лісу.
''',

    22: '''
Її серце закалатало, і вона з усієї сили замружила очі. Зробила крок уперед. У грудях наче щось озвалося, і вона, не вагаючись, штовхнула великий камінь!
Після гучного «бульк!» із пастки вирвався сонячний зайчик. Він м’ячиком застрибав по воді, розсипаючи довкола сріблясті кола. Губи Яги самі собою розтягнулися у легку посмішку, але раптом зайчик засяяв ще яскравіше. Він розширювався, ставав дедалі більшим, поки не перетворився на велике, тепле, сонячне світло, що розлилося навкруги.
''',

    23: '''
Яга застигла, відчуваючи, як щось у ній самій починає змінюватися. Це світло було їй знайоме… Здивовано і трохи розгублено вона дивилася на нього, і в цей момент усе зрозуміла.
Цей зайчик – це частинка її власної душі. Тієї, яку вона колись сховала так глибоко, що й сама про неї забула. Вона вважала, що добро – це слабкість, що його не можна показувати світові. Це тепле світло наповнило її зсередини, огорнуло її серце м’яким, лагідним сяйвом. І в ту мить Яга усвідомила: сила буває різною.
''',

    24: '''
Здивована та переповнена емоціями, Яга стояла на березі озера. Раптом з’явився кіт, скинув шматок водорості з вуха, подивився на неї одночасно своїм блакитним і жовтим оком, обплітаючи їй ноги, і сказав:
— Ось так і повертається добро. Ти, Яго, справжня тільки тоді, коли відкриваєш своє серце. Не забувай цього, бо твоє добро — це і є твоє справжнє чаклунство і тепер ти сильніша, ніж будь-коли… До речі, якщо твій новий шлях включає приготування вечері, то я повністю його підтримую…
''',

    26: '''
Відтоді ліс змінився. Яга більше не лякала всіх підряд, лише сварила тих, хто зрубував дерева чи смітив у лісі. Вона навіть навчилася варити борщ і пекти пиріжки, якими пригощала друзів. І хоча часом бурчала, у її очах з’явився блиск, що нагадував сонячний промінь у туманному лісі.''',

    // ...
    40: '''І стали вони жити довго і щасливо.''',
  },
  'en': {
    1: '''Once upon a time, there was an old man and his wife...''',
    2: '''One day, they planted a turnip...''',
    // ...
    40: '''And they lived happily ever after.''',
  },
  'pl': {
    1: '''Dawno, dawno temu żył sobie dziadek i babcia...''',
    2: '''Pewnego dnia zasiali rzepę...''',
    // ...
    40: '''I żyli długo i szczęśliwie.''',
  },
  'az': {
    1: '''
Budaqlarının vəhşi caynaqlara bənzədiyi və hətta küləklərin ayaq ucunda gezdiyi çox sıx bir meşədə Xo Nənə yaşayırdı. Onun toyuq ayaqları üzərindəki evi çəmənlikdə dayanmışdı. Evin xırıltılı səsi, əyri, hiyləgər gözlər kimi qıyıq pəncərələri və köhnə barıtdan daim asqıran damı var idi. Deyirdilər ki, qadının qazanları heç vaxt soyumur, süpürgəsi gecələr öz-özünə uçur, bir sözlə alfa canavarlar belə quyruğunu qısırdılar qorxudan. Ancaq az adam bilirdi ki, uşaqlıqda bu qorxulu cadugər adi bir qız olub - Xoşəda.''',
    2: 'Bir gün onlar turp əkiblər...',
    // ...
    40: 'Və onlar xoşbəxt yaşayıblar.',
  },
};
