Repository: SergiyKlymenko/yaga_storybook_app
Catalog: lib/l10n/app_*.arb
Languages: az

# appTitle
source: Who Stole My Anger?
az: Qəzəbimi Kim Oğurladı?

source: Start Reading
az: Oxumağa Başla

# aboutAuthor
source: About the Author
az: Müəllif haqqında

# faq
source: How to use?
az: Necə istifadə etməli?

# coloring
source: Coloring pages
az: Boya səhifələri

source: Language
az: Dil

source: Next Page
az: Növbəti səhifə

source: Previous Page
az: Əvvəlki səhifə

# playAudio
source: Listen
az: Dinlə

source: Print
az: Çap et

# aboutAuthorText
source: This app is made with love for stories and children. The author is a word wizard who wants to bring you magical tales.
az: Bu tətbiq nağıllara və uşaqlara sevgi ilə yaradılmışdır. Müəllif sizə sehrli hekayələr bəxş etmək istəyən söz sehrbazıdır.

# faqText
source: To start reading, press 'Start Reading'. To change language, use the menu. To listen to a page, press the speaker button.
az: 'Oxumağa başla' düyməsini basın. Dili dəyişmək üçün menyudan istifadə edin. Səhifəni dinləmək üçün səsgücləndirici düyməsinə basın.

source: Home
az: Əsas səhifə

# continueOnNextPage
source: Continued on the next page...
az: Davamı növbəti səhifədə...

# playGame
source: Play the game
az: Oyun oyna

# startGame
source: Start the game
az: Oyuna başlayın

# gameTitle
source: Yagaâ€™s Magic Path
az: Baba Yaganın Sehrli Yolu

# endGame
source: Finish the game
az: Oyunu bitirin

# points
source: Spell
az: Hərf

source: Game over!
az: Oyun bitdi!
